# -*- coding:utf-8; -*-
#+TITLE: Unit Tests & Examples for Orgtbl Aggregate
Copyright (C) 2013, 2014, 2015, 2016  Thierry Banel

org-aggregate is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

org-aggregate is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.


Running all the tests should not change anything to this page.

All pull-mode tests can be re-computed at once by executing:
(org-update-all-dblocks)

All push-mode tests can be re-computed at once by executing:
(org-table-map-tables
  (lambda ()
    (org-table-align)
    (orgtbl-send-table 'maybe)))

** Resulting tables
Type C-c C-c within each to refresh

Note the =:formula= parameter to add a new column after the aggregation has been computed.

#+BEGIN: aggregate :table pulledtable :cols ("qû" "mean(zö)") :formula "$3=$2*100"
| qû |      mean(zö) |           |
|----+---------------+-----------|
| b  | 6.33333333333 | 633.33333 |
| a  | 4.14285714286 | 414.28571 |
#+TBLFM: $3=$2*100
#+END

Note the additional =$8= column automatically computed after the aggregation

#+BEGIN: aggregate :table pulledtable :cols "sum(xà) qû sum(yÿ) mean(zö) xà*xà min(zö) max(zö)"
| sum(xà)    | qû | sum(yÿ)      |      mean(zö) | xà*xà             | min(zö) | max(zö) |     |
|------------+----+--------------+---------------+-------------------+---------+---------+-----|
| 2 b + 45   | b  | b + b^2 + 32 | 6.33333333333 | 2 b^2 + 6 b + 459 |       1 |       9 |   5 |
| 2 a + 19.1 | a  | 11 a + 12    | 4.14285714286 | 2 a^2 + 78.01     |       1 |       8 | 4.5 |
#+TBLFM: $8=($6+$7)/2
#+END

#+BEGIN: aggregate :table pulledtable :cols "pé count() sum($4) mean(zö) sum(zö*zö) (xà) min(yÿ) max(yÿ)"
| pé | count() |    sum($4) | mean(zö) | sum(zö*zö) | (xà)          |        min(yÿ) |        max(yÿ) |
|----+---------+------------+----------+------------+---------------+----------------+----------------|
|  1 |       3 |         12 |        7 |        161 | [12, 3, 5.1]  |              2 |              8 |
|  3 |       4 |         22 |     3.25 |         87 | [12, 3, 5, 9] |              2 |              8 |
|  2 |       2 |         10 |      3.5 |         29 | [3, 9]        |              2 |              8 |
|  4 |       2 |      a + b |        7 |        100 | [a, b]        |      min(a, b) |      max(a, b) |
|  5 |       2 | 10 a + b^2 |        6 |         80 | [a, b + 3]    | min(10 a, b^2) | max(10 a, b^2) |
#+END

#+BEGIN: aggregate :table pulledtable :cols "count() mean(xà) mean(yÿ) mean(zö)"
| count() | mean(xà)                                            | mean(yÿ)                                             |      mean(zö) |
|---------+-----------------------------------------------------+------------------------------------------------------+---------------|
|      13 | 0.153846153846 a + 0.153846153846 b + 4.93076923077 | 0.846153846154 a + b / 13 + b^2 / 13 + 3.38461538462 | 5.15384615385 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "pé count() mean(zö) meane(zö) gmean(zö) hmean(zö) median(zö)"
| pé | count() | mean(zö) | meane(zö)              |     gmean(zö) |     hmean(zö) | median(zö) |
|----+---------+----------+------------------------+---------------+---------------+------------|
|  1 |       3 |        7 | 7 +/- 1.52752523165    | 6.60385449779 | 6.17142857143 |          8 |
|  3 |       4 |     3.25 | 3.25 +/- 1.93110503771 | 2.05976714391 | 1.53191489362 |        1.5 |
|  2 |       2 |      3.5 | 3.5 +/- 1.5            | 3.16227766017 | 2.85714285714 |        3.5 |
|  4 |       2 |        7 | 7 +/- 1                | 6.92820323028 | 6.85714285714 |          7 |
|  5 |       2 |        6 | 6 +/- 2                | 5.65685424949 | 5.33333333333 |          6 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "qû count() prod(zö) sdev(zö) pvar(zö) psdev(zö)"
| qû | count() | prod(zö) |      sdev(zö) |      pvar(zö) |     psdev(zö) |
|----+---------+----------+---------------+---------------+---------------|
| b  |       6 |    19440 | 3.07679486912 | 7.88888888889 | 2.80871659106 |
| a  |       7 |     4096 | 2.85356919364 | 6.97959183673 | 2.64189171556 |
#+END

#+BEGIN: aggregate :table pulledtable :cols "qû count() cov(zö,xà) pcov(zö,zö) corr(zö,zö)"
| qû | count() | cov(zö,xà)                       |   pcov(zö,zö) | corr(zö,zö) |
|----+---------+----------------------------------+---------------+-------------|
| b  |       6 | 0.266666666667 b + 1.79999999998 | 7.88888888889 |          1. |
| a  |       7 | 0.619047619049 a - 1.22142857143 | 6.97959183673 |          1. |
#+END

* Test empty and non-numeric

#+tblname: nonnumeric
|  X |
|----|
|  1 |
|  2 |
| aa |
|    |
|  4 |

#+BEGIN: aggregate :table "nonnumeric" :cols "(X) (X);E (X);N (X);EN"
| (X)           | (X);E              | (X);N        | (X);EN          |
|---------------+--------------------+--------------+-----------------|
| [1, 2, aa, 4] | [1, 2, aa, nan, 4] | [1, 2, 0, 4] | [1, 2, 0, 0, 4] |
#+END:

#+BEGIN: aggregate :table "nonnumeric" :cols "mean(X) mean(X);E mean(X);N mean(X);EN"
| mean(X)       | mean(X);E | mean(X);N | mean(X);EN |
|---------------+-----------+-----------+------------|
| aa / 4 + 1.75 |       nan |      1.75 |        1.4 |
#+END:

Comparison with the spreadsheet:

| 1                  |                 1 |
| 2                  |                 2 |
| aa                 |                aa |
|                    |                   |
| 4                  |                 4 |
|--------------------+-------------------|
| [1, 2, aa, 4]      | 0.75 + aa / 4 + 1 |
| [1, 2, aa, nan, 4] |               nan |
| [1, 2, 0, 4]       |              1.75 |
| [1, 2, 0, 0, 4]    |               1.4 |
#+TBLFM: @6$1=@1..@5 :: @7$1=@1..@5;E :: @8$1=@1..@5;N :: @9$1=@1..@5;EN :: @6$2=vmean(@1..@5) :: @7$2=vmean(@1..@5);E :: @8$2=vmean(@1..@5);N :: @9$2=vmean(@1..@5);EN

* Test input errors

#+tblname: inputerrors
| A |  Q |     R |         Z | D            |
|---+----+-------+-----------+--------------|
| a |  3 |    10 | 2.3025851 | [2014-11-05] |
| a | 4+ |    20 | 2.9957323 | [2014-11-21] |
| b |  t | (88*) |    #ERROR | [2014-12-07] |
| b |  1 |    41 | 3.7135721 | [2014-12-23] |
| b |  2 |   111 | 4.7095302 | [2015-01-08] |
| c |  8 |   z ' |    #ERROR |              |
| c | 4= |     4 | 1.3862944 |              |
#+TBLFM: $4=log($3)

#+BEGIN: aggregate :table "inputerrors" :cols "A sum(Q) sum(R)"
| A | sum(Q)                             | sum(R)                               |
|---+------------------------------------+--------------------------------------|
| a | error(2, '"Expected a number") + 3 | 30                                   |
| b | t + 3                              | error(4, '"Expected a number") + 152 |
| c | error(2, '"Expected a number") + 8 | error(2, '"Syntax error") + 4        |
#+END:

#+BEGIN: aggregate :table "inputerrors" :cols "A (Q) (R)"
| A | (Q)                                 | (R)                                       |
|---+-------------------------------------+-------------------------------------------|
| a | [3, error(2, '"Expected a number")] | [10, 20]                                  |
| b | [t, 1, 2]                           | [error(4, '"Expected a number"), 41, 111] |
| c | [8, error(2, '"Expected a number")] | [error(2, '"Syntax error"), 4]            |
#+END:

